Repository: xuthus83/pigallery2
Catalog: frontend/translate/messages.*.xlf
Languages: hu

source: Please log in
hu: Jelentkezz be

source: Wrong username or password
hu: Rossz felhasználónév vagy jelszó

source: Username
hu: Felhasználónév

source: Password
hu: Jelszó

source: Remember me
hu: Emlékezz rám

source: Login
hu: Belépés

source: Wrong password
hu: Rossz jelszó

source: Enter
hu: Belép

source: download
hu: letöltés

source: info key: i
hu: info gyorsgomb: i

source: toggle fullscreen, key: f
hu: teljes képernyős váltás, gyorsgomb: f

source: close, key: Escape
hu: bezárás, gyorsgomb: escape

source: key: left arrow
hu: gyorsgomb: balra nyíl

source: key: right arrow
hu: gyorsgomb: jobbra nyíl

source: Zoom out, key: '-'
hu: Kicsinyítés, gyorsgomb: '-'

source: Zoom in, key: '+'
hu: Nagyítás, gyorsgomb: '+'

source: Link availability
hu: Link elérhetősége

source: days
hu: nap

source: Too many results to show. Refine your search.
hu: Túl sok eredmény jelenik meg. Pontosítsa a keresést.

source: Gallery
hu: Képek

source: Faces
hu: Arcok

source: Settings
hu: Beállítások

source: Logout
hu: Kijelentkezés

source: Search
hu: Keresés

source: Share
hu: Megosztás

source: Copy
hu: Másolás

source: Sharing:
hu: megosztás:

source: Include subfolders:
hu: Alkönyvtárak beillesztése:

source: Valid:
hu: Érvényes:

source: Minutes
hu: Percek

source: Hours
hu: Órák

source: Days
hu: Napok

source: Months
hu: Hónapok

source: Searching for:
hu: Keresés:

source: items
hu: elem

source: Server notifications
hu: Szerver értesítések

source: To dismiss these notifications, restart the server.
hu: Az ilyen értesítések elutasításához indítsa újra a kiszolgálót.

source: App version:
hu: Verzió:

source: Mode
hu: Mód

source: duration
hu: hossz

source: bit rate
hu: bit ráta

source: Random link
hu: Véletlen link

source: Random Link generator
hu: Véletlen Link generátor

source: In Folder:
hu: A mappában:

source: Orientation:
hu: Orientáció:

source: Any
hu: Bármilyen

source: Landscape
hu: Fekvő

source: Portrait
hu: Álló

source: Date:
hu: Dátum:

source: Resolution:
hu: Felbontás:

source: Password protection
hu: Jelszavas védelem

source: Name
hu: Név

source: Role
hu: Szerep

source: + Add user
hu: + Felhasználó felvétele

source: To protect the site with password / have login enable this.
hu: A webhely jelszóval való védelme / a bejelentkezés engedélyezi ezt.

source: Add new User
hu: Új felhasználó hozzáadása

source: Close
hu: Bezárás

source: Add User
hu: Felhasználó hozzáadása

source: Database settings
hu: Adatbázis beállítások

source: Type:
hu: Típus:

source: Install manually mysql node module to use mysql (npm install mysql)
hu: Telepítsd kézzel mysql csomópont-modulot a mysql (npm install mysql) használatához

source: MySQL settings:
hu: MySQL beállítások:

source: Database
hu: Adatbázis

source: SQLite settings:
hu: SQLite beállítások:

source: Save
hu: Mentés

source: Reset
hu: Visszaállítás

source: Map settings
hu: Térképbeállítások

source: Map will use thumbnail images as markers instead of the default pin.
hu: A térkép ikonokat fog használni az alap jelölő pin helyett

source: Map provider
hu: Térképszolgáltató

source: *The map module will use these urls to fetch the map tiles.
hu: *A térkép ezeket a url-eket fogja használni a térkép csempék betöltéséhez.

source: + Add Layer
hu: + Új Térkép

source: MapBox needs an access token to work, create one at
hu: A MapBox-hoz access token szükséges, amit itt lehet létrehozni:

source: Save
hu: Mentés

source: Reset
hu: Visszaállítás

source: Thumbnail settings
hu: Thumbnail beállítások

source: It is highly recommended to use hardware accelerated (sharp or gm) lib for thumbnail generation
hu: Nagyon ajánlott hardveres gyorsított (sharp vagy gm) modul használata a thumbnail-ek generálásához

source: Thumbnail generation library
hu: Thumbnail generáló könyvtár

source: Make sure that sharp node module is installed (npm install sharp).
hu: Győződjön meg arról, hogy az éles csomópont modul telepítve van (npm telepítés éles).

source: Make sure that gm node module and
hu: Győződj meg róla, hogy a gm node modul és

source: are installed (npm install sharp).
hu: telepítve van (npm install sharp).

source: Thumbnail folder
hu: Thumbnail mappa

source: Thumbnails will be saved in this folder. Write access is required
hu: A miniatűrök ebben a mappában lesznek elmentve. Íráshoz való hozzáférés szükséges

source: High quality may be slow. Especially with Jimp.
hu: A jó minőség lassú lehet. Különösen a Jimp estén.

source: Icon size (used on maps)
hu: Ikonméret (térképeken lesz használva)

source: Thumbnail sizes
hu: Thumbnail méretek

source: Size of the thumbnails.
hu: A thumbnail-ok mérete.

source: The best matching size will be generated. (More size gives better quality, but use storage to store and CPU to render.)
hu: A leginkább eggyező méret lesz generálva. (A nagyobb méret jobb minőségű képet jelent, de nagyobb számításigényű és több helyet is foglal.)

source: ';' separated integers. If size is 200, that thumbnail will have 200^2 pixels.
hu: ';' elválasztott egész számok. Ha a méretnek pl. 200-t állítasz be, akkor a thumbnail 200^2 pixelből fog állni.

source: Video settings
hu: Videó beállítások

source: Video support uses ffmpeg. ffmpeg and ffprobe binaries need to be available in the PATH or the @ffmpeg-installer/ffmpeg and @ffprobe-installer/ffprobe optional node packages need to be installed.
hu: A videó lejátszához az ffmpeg szükséges. Az ffmpeg és az ffprobe binárisoknak rendelkezésre kell állniuk a PATH-ban vagy az @ffmpeg-installer/ffmpeg és @ffprobe-installer/ffprobe opcionális node csomagokat kell telepíteni.

source: Meta file settings
hu: Meta fájl beállítások

source: Reads and show *.gpx files on the map
hu: Megjeleníti a *.gpx fájlokat a térképen

source: Search settings
hu: Keresési beállítások

source: Show hints while typing search query
hu: Tippek felajánlása a keresés gépelése közben

source: Instant search
hu: Instant keresés

source: Enables showing search results, while typing search query
hu: Lehetővé teszi a keresési eredmények megjelenítését a keresési lekérdezés beírása közben

source: Search is not supported with these settings
hu: A keresés nem támogatott ezekkel a beállításokkal

source: Share settings
hu: Megosztási beállítások

source: Password protected
hu: Jelszóval védett

source: Enables password protected sharing links
hu: Engedélyezi a jelszóval védett megosztást

source: Sharing is not supported with these settings
hu: A megosztás nem támogatott ezekkel a beállításokkal

source: Random Photo settings
hu: Véletlen fotó beállítások

source: This feature enables you to generate 'random photo' urls. That URL returns a photo random selected from your gallery. You can use the url with 3rd party like random changing desktop background.
hu: Ez a funkció lehetővé teszi a "véletlenszerű fotó" URL-ek létrehozását. Ez az URL egy galériából kiválasztott véletlenszerű fényképet jelenít meg. Használhatja az url-t külső alkalmazásokhoz, például a asztali háttérkép beállításához.

source: Random Photo is not supported with these settings
hu: Ezeket a beállításokat nem támogatja a véletlenszerű fénykép

source: Basic settings
hu: Alapbeállítások

source: Page title
hu: Oldal címe

source: Server will accept connections from this IPv6 or IPv4 address.
hu: A szerver csak erről az (IPv6 vagy az IPv4) címből származó kapcsolatokat fog fogadni.

source: Port number. Port 80 is usually what you need.
hu: Portszám. A 80-as port általában az, amire szükséged van.

source: Images folder
hu: Képek mappa

source: Images are loaded from this folder (read permission required)
hu: A képek ebből a mappából töltődnek be (olvasási engedély szükséges a mappára)

source: Page public url
hu: Oldal nyilvános url-je

source: If you access the page form local network its good to know the public url for creating sharing link
hu: Ha az oldalt a helyi hálózaton keresztül éred el, jó tudni a nyilvánosságot URL-t megosztási link létrehozásához

source: Url Base
hu: Al cím

source: If you access the gallery under a sub url (like: http://mydomain.com/myGallery), set it here. If not working you might miss the '/' from the beginning of the url.
hu: Ha a galériát egy al-url alatt érheti el (például: http://mydomain.com/myGallery), állítsa be itt. Ha nem működik, akkor hiányozhat a "/" a kezdetétől url.

source: The public url and the url base are not matching. Some of the functionality might not work.
hu: A nyilvános url és az al url nem eggyeznek meg. Néhány funkció lehet hogy nem fog működni.

source: Override keywords
hu: Kép tag felülírása

source: If a photo has the same face (person) name and keyword, the app removes the duplicate, keeping the face only.
hu: Ha létezik arc (személy) és kép tag ugyanazzal a nézzel, csak az arc-ot mutatja.

source: Required minimum right to start (favourite) a face.
hu: Szükséges minimális jogosultás a arcok kedvencekközé tételéhez.

source: Faces are not supported with these settings.
hu: Arcok ezzel a beállítással nem támogatottak.

source: Other settings
hu: Egyéb beállitások

source: Error:
hu: Hiba:

source: Threads:
hu: Szálak:

source: Threading
hu: Többszálas működés

source: Runs directory scanning and thumbnail generation (only for Jimp) in a different thread
hu: Külön szálon futtatja a könyvtár scnalést és a thumbnail generalást(csak Jimp számára)

source: Thumbnail threads
hu: Thumbnail szálak

source: Number of threads that are used to generate thumbnails. If auto, number of CPU cores -1 threads will be used.
hu: A miniatűrök előállításához használt szálak száma. Ha auto-ra van állítva, a CPU magok száma -1 szálat fog használni.

source: Misc:
hu: Egyéb:

source: Scroll based thumbnail generation
hu: Görgetés alapú thumbnail generálás

source: Those thumbnails get higher priority that are visible on the screen
hu: Azok a thumbnail-ek nagyobb prioritást kapnak, ami látható a képernyőn

source: Lazy image rendering
hu: 'Lazy' kép megjelenítés

source: Shows only the required amount of photos at once. Renders more if page bottom is reached
hu: Csak a szükséges mennyiségű fotót jeleníti meg egyszerre. Újabb fotókat jelenít meg, ha elérte az oldal alját

source: Cache
hu: Gyorsítótár

source: Caches directory contents and search results for better performance
hu: Cache-eli a könyvtár tartalmát és a keresési eredményeket a gyorsabb betöltés érdekében

source: Caption first naming
hu: Képaláírás alapú elnevezés

source: Show the caption (IPTC 120) tags from the EXIF data instead of the filenames.
hu: Fájl nev helyett a képaláírás (IPTC 120) címkét mutatja, amit az EXIF-adatokból nyert ki.

source: Navigation bar:
hu: Navigációs sáv:

source: Show item count
hu: Az elemek számának megjelenítése

source: Show the number of items (photos) in the folder
hu: A mappában lévő elemek (fotók) számának mutatása

source: Default photo sorting method
hu: Az alapértelmezett fotó rendezés

source: Folder indexing
hu: Mappa indexelése

source: Index cache timeout [ms]
hu: Index cache időtúllépése [ms]

source: If there was no indexing in this time, it reindexes. (skipped if indexes are in DB and sensitivity is low)
hu: Ha ebben az időben nem volt indexelés, újraindexelést hajt végre. (figyelmen kívül hagyja, ha az érzékenység alacsony)

source: Sub folder preview size
hu: Alkönyvtár előnézeti mérete

source: Reads this many photos from sub folders
hu: Ennyi fotót olvas be az almappákból (ezek közül választ az oldal amikor mappához mutat egy képet)

source: Folder reindexing sensitivity
hu: Mappa indexelés érzékenysége

source: Set the reindexing sensitivity. High value check the folders for change more often
hu: Állítsa be az újraindexelés érzékenységét. Nagy érzékenység gyakrabban vizgyálja a mappát ellenőrzi a mappákat, változásokat keresve

source: Save
hu: Mentés

source: Reset
hu: Visszaállítás

source: If you add a new folder to your gallery, the site indexes it automatically.
hu: Ha új mappát ad hozzá a galériához, a webhely automatikusan indexeli.

source: If you would like to trigger indexing manually, click index button.
hu: Ha kézzel szeretné indítani az indexelést, kattintson az index gombra.

source: Note: search only works among the indexed directories
hu: Megjegyzés: csak az indexelt könyvtárak között működik a keresés

source: indexing
hu: indexelés

source: elapsed
hu: eltelt

source: left
hu: hátra

source: Indexes the folders
hu: Indexeli a mappákat

source: Index with Thumbnails
hu: Index thumbnail-el

source: Indexes the folders and also creates the thumbnails
hu: Indexeli a mappákat és legenerálja a thumbnaileket is

source: Cancel
hu: Mégse

source: Reset Indexes
hu: Indexek visszaállítása

source: Statistic:
hu: Statisztika:

source: Folders
hu: Mappák

source: Photos
hu: Fotók

source: Videos
hu: Videók

source: Size
hu: Méret

source: No duplicates found
hu: Nincsenek másolatok

source: Server error
hu: Szerver hiba

source: Server info
hu: Szerverinformáció

source: h
hu: ó

source: m
hu: p

source: s
hu: mp

source: ascending name
hu: név szerint növekvő

source: descending name
hu: név szerint csökkenő

source: ascending date
hu: dátum szerint növekvő

source: descending date
hu: dátum szerint csökkenő

source: random
hu: véletlen

source: Advanced
hu: Részletes

source: Simplified
hu: Egyszerűsített

source: Images
hu: Képek

source: Yes
hu: Igen

source: No
hu: Nem

source: Url has been copied to clipboard
hu: Az URL a vágólapra lett másolva

source: loading..
hu: betöltés..

source: Enabled
hu: Engedélyezve

source: Disabled
hu: Tiltva

source: Low
hu: Alacsony

source: High
hu: Magas

source: settings saved
hu: beállítások elmentve

source: Success
hu: Siker

source: Basic
hu: Alap

source: Restart the server to apply the new settings
hu: Indítsd újra a weboldalt az új beállítások alkalmazásához

source: Indexing
hu: Indexelés

source: Folder indexed
hu: Mappa indexelve

source: low
hu: alacsony

source: medium
hu: közepes

source: high
hu: magas

source: Folder indexing started
hu: Elkezdődött a mappa indexelése

source: Folder indexing interrupted
hu: A mappa indexelése megszakadt

source: Database reset
hu: Adatbázis visszaállítása

source: Map
hu: Térkép

source: Meta file
hu: Meta fájl

source: Other
hu: Egyéb

source: Random Media
hu: Véletlenszerű média

source: (recommended)
hu: (ajánlott)

source: (deprecated)
hu: (elavult)

source: Password protection enabled
hu: Jelszavas védelem engedélyezve

source: Server restart is recommended.
hu: Szerver újraindítása javasolt.

source: Password protection disabled
hu: Jelszavas védelem tiltva

source: Video
hu: Videó
